docs/test_coverage.html

<div id="outline-container-org45e9669" class="outline-2">
<h2 id="org45e9669"><span class="section-number-2">1.</span> MRcolorTpl.hpp</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Coverage</th>
<th scope="col" class="org-left">Method</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(const colorType&amp; );</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(clrChanT, clrChanT, clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(clrChanT, clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(cornerColorEnum);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(std::string);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">colorTpl(const char*);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">~colorTpl();</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">colorTpl&amp; copy(colorArgType);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC0() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC1() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC2() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC3() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getChan(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC0(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC1(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC2(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC3(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChan(int, clrChanT);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setChanToMax(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setChanToMin(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans(clrChanT, clrChanT, clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans(clrChanT, clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans(clrChanT, clrChanT);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans(clrChanT);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setChans(std::tuple&lt;clrChanT, clrChanT, clrChanT, clrChanT&gt;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setChans(std::tuple&lt;clrChanT, clrChanT, clrChanT&gt;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">setChans(std::vector&lt;clrChanT&gt;&amp;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans(std::string, bool);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC0_dbl();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC1_dbl();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC2_dbl();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC3_dbl();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getChan_dbl(int);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChan_dbl(int, double);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC0_dbl(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC1_dbl(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC2_dbl(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC3_dbl(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_dbl(double, double, double, double);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_dbl(double, double, double);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_dbl(double, double);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_dbl(double);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">bestRedChan()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">bestGreenChan()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">bestBlueChan()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">bestAlphaChan()</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_dbl(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_byte(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChansRGBA_dbl(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChansRGB_dbl(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChansRGBA_byte(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChansRGB_byte(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColCon_dbl()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColCon_byte()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColConRGBA_dbl()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColConRGB_dbl()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColConRGBA_byte()</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getColConRGB_byte()</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC0_byte() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC1_byte() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC2_byte() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getC3_byte() const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getChan_byte(int) const;</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChan_byte(int, uint8_t);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC0_byte(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC1_byte(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC2_byte(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setC3_byte(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_byte(uint8_t, uint8_t, uint8_t, uint8_t);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_byte(uint8_t, uint8_t, uint8_t);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_byte(uint8_t, uint8_t);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setChans_byte(uint8_t);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToBlack();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToWhite();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToRed();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToBlue();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToGreen();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToCyan();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToYellow();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToMagenta();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToCorner(char);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToCorner(cornerColorEnum);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setToCorner(std::string);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBAfromLogPackIntABGR(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromLogPackIntABGR(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBAfromLogPackIntARGB(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromLogPackIntARGB(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBAfromLogPackIntRGBA(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromLogPackIntRGBA(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBAfromLogPackIntABRG(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromLogPackIntABRG(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBAfromLogPackIntBGRA(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromLogPackIntBGRA(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setRGBAfromLogPackIntGen(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">setRGBfromLogPackIntGen(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">setRGBAfromPackIntGen(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">setRGBfromPackIntGen(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromUnitHSV(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromUnitHSL(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromColorSpace(colorSpaceEnum, double, double, double);</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">setRGBfromColorSpace(colorSpaceEnum, colorTpl&lt;double, 3&gt;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">interplColorSpace(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">rgb2colorSpace(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">colorSpaceToString(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBcmpGreyTGA16bit(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBcmpGreyTGA24bit(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromWavelengthCM(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromWavelengthLA(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cmpGradiant(csFltType, std::vector&lt;csFltType&gt;, std::vector&lt;colorType&gt;);</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cmpGradiant(csFltType, std::vector&lt;colorType&gt;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">cmpGradiant(csFltType, csIntType, const packed4Cint*)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">cmpRGBcornerDGradiant(csIntType, const char*);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">cmpRGBcornerDGradiant(csIntType, csIntType, const ccT*)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">cmpRGBcornerCGradiant(csFltType, const char*) {</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">cmpRGBcornerCGradiant(csFltType, csIntType, const ccT*)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">wMean( 8 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">wMean( 6 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">wMean( 4 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">uMean( 7 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">uMean( 5 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">uMean( 3 args</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">linearInterpolate(double, colorArgType, colorArgType);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmOr(&#x2026;)         No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmNor(&#x2026;)        No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmAnd(&#x2026;)        No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmNand(&#x2026;)       No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmXor(&#x2026;)        No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmNxor(&#x2026;)       No coverage for float clrChanT</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmNot(void)       No coverage for float clrChanT</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmSqDiff(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmAbsDiff(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmAdd(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmDiv(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMult(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMultClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmSignDiff(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmDiffClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmNegDiffClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmAddClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmAddDivClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmDiff(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMod(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmInvert();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMix(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmCopy(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMaxI(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMinI(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMax(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMin(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmShiftL(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmShiftR(&#x2026;)</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmSaw(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmStep(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmDiracTot(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmDirac(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmFuzzyDirac(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmMean(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmGmean(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmGmeanClamp(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmGreyScaleRGB(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmWebSafeRGB();</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmLinearGreyLevelScale(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmLinearGreyLevelScaleRGB(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmStdPow(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmStdPowRGB(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmStdPowSqr(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmStdPowSqrt(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">tfrmLn();</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">rgb2GreyDotProd(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">luminanceRGB(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">intensityRGB(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">intensity(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">intensityScaledRGB(void);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">intensityScaled(void);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getMaxC();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getMinC();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getMaxRGB();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">getMinRGB();</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">dotProd(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">distHypot(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">distSumAbs(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">distMaxAbs(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">distDeltaE1976(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">distDeltaE1994(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isEqual(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isEqualRGB(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isClose(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isCloseRGB(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isNotEqual(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isBlack();</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">isBlackRGB();</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">clampTop(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">clampBot(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">clampAll(&#x2026;);</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csBin01</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinGB</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinRB</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinMC</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinYC</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinRG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csBinMY</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csBin_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBAccent</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBBlues</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBBrBG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBBuGn</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBBuPu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBDark2</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBGnBu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBGreens</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBGreys</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBOrRd</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBOranges</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPRGn</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPaired</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPastel1</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPastel2</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPiYG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPuBu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPuBuGn</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPuOr</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPuRd</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBPurples</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBRdBu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBRdGy</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBRdPu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBRdYlBu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBRdYlGn</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBReds</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBSet1</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBSet2</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBSet3</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csCBSpectral</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBYlGn</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBYlGnBu</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBYlOrBr</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCBYlOrRd</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csCB_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csCC_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCconsOne</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCconsTwo</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCdiag01</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCdiagCR</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCdiagMG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCdiagYB</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCColdeColdToHot</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCColdeFireRamp</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCColdeIceToWaterToHot</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csCColdeRainbow</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumBGR</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumBRG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumGBR</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumGRB</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumRBG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCsumRGB</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudBg</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudBr</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudGb</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudGr</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudRb</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csCCudRg</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csCHblu</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csCHstd</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csCHvio</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csCubeHelix_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csFP_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPblAqGrYeOrReVi200</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csFPcircular12</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcircular24</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanAlgae</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanAmp</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanBalance</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanCurl</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanDeep</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanDense</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanHaline</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanIce</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPcmoceanTempo</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPmplBrBG</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPmplOcean</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPmplOranges</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPneoDdivVegetationA</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPneoDivVegetationC</td>
</tr>

<tr>
<td class="org-left">SIMILAR</td>
<td class="org-left">csFPneoModisNdvi</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWS_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWSnormalVision</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWSprotanopia</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWSdeutanopia</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWStritanoptia</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWSprotanopiaAlt</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWSdeutanopiaAlt</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csWStritanoptiaAlt</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhB</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhC</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhG</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhM</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhR</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csHSLhY</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csHSLh_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csPGrey3x</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csPGrey4x</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csPLY_tpl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYcividis</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csPLYgrey</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYhsvRB</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYinferno</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYmagma</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYparula</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYplasma</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">csPLYquad</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYturbo</td>
</tr>

<tr>
<td class="org-left">INDIRECT</td>
<td class="org-left">csPLYviridis</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csRainbowCM</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">csRainbowLA</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromWavelengthCM(&#x2026;);</td>
</tr>

<tr>
<td class="org-left">DIRECT</td>
<td class="org-left">setRGBfromWavelengthLA(&#x2026;);</td>
</tr>
</tbody>
</table>
</div>
</div>
